Revit 2024 API
Stairs.BaseElevation Property
 The base elevation of the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double BaseElevation { get; }
Visual Basic
Public ReadOnly Property BaseElevation As Double
	Get
Visual C++
public:
property double BaseElevation {
	double get ();
}
See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace